In [1]:
import pandas as pd

In [2]:
city_names = pd.Series(['San Fransisco', 'San Jose', 'Sacramento'])
city_population = pd.Series([131, 43425, 5353])

In [3]:
cities = pd.DataFrame({'city name': city_names, 'population': city_population})

In [4]:
cities

       city name  population
0  San Fransisco         131
1       San Jose       43425
2     Sacramento        5353

In [6]:
city_names.index

RangeIndex(start=0, stop=3, step=1)

In [7]:
cities.index

RangeIndex(start=0, stop=3, step=1)

In [9]:
new_order = [1, 2, 0]
cities.reindex(new_order)

       city name  population
1       San Jose       43425
2     Sacramento        5353
0  San Fransisco         131